<abi-corpus version='2.2' path='build/libzxc.so.0.13.1' architecture='elf-amd-x86_64' soname='libzxc.so.4'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='zxc_compress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_compress_block' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_compress_block_bound' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_compress_bound' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_compress_cctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_compress_opts_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_create_cctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_create_dctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_cstream_compress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zxc_estimate_cctx_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_free_cctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_free_dctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_get_decompressed_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_get_dict_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_init_static_cctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_init_static_dctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_max_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_min_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seek_table_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_decompress_range' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_decompress_range_mt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_get_block_comp_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_get_block_decomp_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_get_decompressed_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_get_num_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_open' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_open_file' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_open_reader' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_set_dict' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_static_cctx_workspace_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_static_dctx_workspace_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_stream_compress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_stream_decompress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_stream_get_decompressed_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_train_dict' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_train_dict_huf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_version_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_write_seek_table' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='/src/src/lib/zxc_common.c' comp-dir-path='/src/build' language='LANG_C11'>
    <qualified-type-def type-id='type-id-1' restrict='yes' id='type-id-2'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <qualified-type-def type-id='type-id-4' restrict='yes' id='type-id-5'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-7'/>
    <qualified-type-def type-id='type-id-7' restrict='yes' id='type-id-8'/>
    <function-decl name='zxc_huf_dict_tree_build' filepath='/src/src/lib/zxc_internal.h' line='1514' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='free' filepath='/src/usr/include/stdlib.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='posix_memalign' filepath='/src/usr/lib/gcc/x86_64-linux-gnu/13/include/mm_malloc.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_compress.c' comp-dir-path='/src/build' language='LANG_C11'>
    <class-decl name='zxc_gnr_header_t' size-in-bits='96' is-struct='yes' naming-typedef-id='type-id-16' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='982' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='n_sequences' type-id='type-id-18' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='983' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='n_literals' type-id='type-id-18' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='984' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='enc_lit' type-id='type-id-19' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='985' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='enc_litlen' type-id='type-id-19' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='986' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='enc_mlen' type-id='type-id-19' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='987' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='enc_off' type-id='type-id-19' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='988' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_section_desc_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-20' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='998' column='1' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sizes' type-id='type-id-22' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='999' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zxc_gnr_header_t' type-id='type-id-17' filepath='/src/src/lib/zxc_internal.h' line='989' column='1' id='type-id-16'/>
    <typedef-decl name='zxc_section_desc_t' type-id='type-id-21' filepath='/src/src/lib/zxc_internal.h' line='1000' column='1' id='type-id-20'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-24'/>
    <qualified-type-def type-id='type-id-24' restrict='yes' id='type-id-25'/>
    <qualified-type-def type-id='type-id-20' const='yes' id='type-id-26'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-27'/>
    <qualified-type-def type-id='type-id-12' restrict='yes' id='type-id-28'/>
    <qualified-type-def type-id='type-id-12' restrict='yes' id='type-id-29'/>
    <qualified-type-def type-id='type-id-12' restrict='yes' id='type-id-30'/>
    <qualified-type-def type-id='type-id-12' restrict='yes' id='type-id-31'/>
    <function-decl name='zxc_write_glo_header_and_desc' filepath='/src/src/lib/zxc_internal.h' line='1392' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_write_ghi_header_and_desc' filepath='/src/src/lib/zxc_internal.h' line='1423' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_build_code_lengths_avx2' filepath='/src/src/lib/zxc_internal.h' line='1472' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_build_code_lengths_avx512' filepath='/src/src/lib/zxc_internal.h' line='1472' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_build_code_lengths_default' filepath='/src/src/lib/zxc_internal.h' line='1472' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_build_code_lengths_sse2' filepath='/src/src/lib/zxc_internal.h' line='1472' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_calc_size_avx2' filepath='/src/src/lib/zxc_internal.h' line='1502' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='zxc_huf_calc_size_avx512' filepath='/src/src/lib/zxc_internal.h' line='1502' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='zxc_huf_calc_size_default' filepath='/src/src/lib/zxc_internal.h' line='1502' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='zxc_huf_calc_size_sse2' filepath='/src/src/lib/zxc_internal.h' line='1502' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_avx2' filepath='/src/src/lib/zxc_internal.h' line='1506' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_avx512' filepath='/src/src/lib/zxc_internal.h' line='1506' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_default' filepath='/src/src/lib/zxc_internal.h' line='1506' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_sse2' filepath='/src/src/lib/zxc_internal.h' line='1506' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_calc_size_dict_avx2' filepath='/src/src/lib/zxc_internal.h' line='1519' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='zxc_huf_calc_size_dict_avx512' filepath='/src/src/lib/zxc_internal.h' line='1519' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='zxc_huf_calc_size_dict_default' filepath='/src/src/lib/zxc_internal.h' line='1519' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='zxc_huf_calc_size_dict_sse2' filepath='/src/src/lib/zxc_internal.h' line='1519' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_dict_avx2' filepath='/src/src/lib/zxc_internal.h' line='1523' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_dict_avx512' filepath='/src/src/lib/zxc_internal.h' line='1523' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_dict_default' filepath='/src/src/lib/zxc_internal.h' line='1523' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_dict_sse2' filepath='/src/src/lib/zxc_internal.h' line='1523' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_write_block_header' filepath='/src/src/lib/zxc_internal.h' line='1867' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_decompress.c' comp-dir-path='/src/build' language='LANG_C11'>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-36'/>
    <qualified-type-def type-id='type-id-36' restrict='yes' id='type-id-37'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-38'/>
    <function-decl name='zxc_read_glo_header_and_desc' filepath='/src/src/lib/zxc_internal.h' line='1409' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_read_ghi_header_and_desc' filepath='/src/src/lib/zxc_internal.h' line='1441' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_avx2' filepath='/src/src/lib/zxc_internal.h' line='1531' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_avx512' filepath='/src/src/lib/zxc_internal.h' line='1531' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_default' filepath='/src/src/lib/zxc_internal.h' line='1531' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_sse2' filepath='/src/src/lib/zxc_internal.h' line='1531' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_dict_avx2' filepath='/src/src/lib/zxc_internal.h' line='1536' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_dict_avx512' filepath='/src/src/lib/zxc_internal.h' line='1536' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_dict_default' filepath='/src/src/lib/zxc_internal.h' line='1536' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_dict_sse2' filepath='/src/src/lib/zxc_internal.h' line='1536' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_cctx_alloc_entropy_scratch' filepath='/src/src/lib/zxc_internal.h' line='1729' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_dict.c' comp-dir-path='/src/build' language='LANG_C11'>
    <qualified-type-def type-id='type-id-41' restrict='yes' id='type-id-33'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-40'/>
    <qualified-type-def type-id='type-id-40' restrict='yes' id='type-id-43'/>
    <function-decl name='zxc_compress_bound' filepath='/src/src/lib/../../include/zxc_buffer.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zxc_huf_build_code_lengths' filepath='/src/src/lib/zxc_internal.h' line='1472' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_pack_lengths' filepath='/src/src/lib/zxc_internal.h' line='1478' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zxc_cctx_init' filepath='/src/src/lib/zxc_internal.h' line='1647' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_cctx_free' filepath='/src/src/lib/zxc_internal.h' line='1739' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zxc_compress_chunk_wrapper' filepath='/src/src/lib/zxc_internal.h' line='1786' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='malloc' filepath='/src/usr/include/stdlib.h' line='672' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-12'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_dispatch.c' comp-dir-path='/src/build' language='LANG_C11'>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-47'/>
    <qualified-type-def type-id='type-id-47' restrict='yes' id='type-id-39'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-48'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-49'/>
    <qualified-type-def type-id='type-id-49' restrict='yes' id='type-id-34'/>
    <function-decl name='zxc_dict_id' filepath='/src/src/lib/../../include/zxc_dict.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='zxc_write_seek_table' filepath='/src/src/lib/../../include/zxc_seekable.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_default' filepath='/src/src/lib/zxc_dispatch.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_dict_default' filepath='/src/src/lib/zxc_dispatch.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_safe_default' filepath='/src/src/lib/zxc_dispatch.c' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_avx2' filepath='/src/src/lib/zxc_dispatch.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_dict_avx2' filepath='/src/src/lib/zxc_dispatch.c' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_avx512' filepath='/src/src/lib/zxc_dispatch.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_dict_avx512' filepath='/src/src/lib/zxc_dispatch.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_safe_avx2' filepath='/src/src/lib/zxc_dispatch.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_safe_avx512' filepath='/src/src/lib/zxc_dispatch.c' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_sse2' filepath='/src/src/lib/zxc_dispatch.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_dict_sse2' filepath='/src/src/lib/zxc_dispatch.c' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_safe_sse2' filepath='/src/src/lib/zxc_dispatch.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_compress_chunk_wrapper_default' filepath='/src/src/lib/zxc_dispatch.c' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_dict_tree_build_default' filepath='/src/src/lib/zxc_dispatch.c' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_huf_pack_lengths_default' filepath='/src/src/lib/zxc_dispatch.c' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zxc_huf_unpack_lengths_default' filepath='/src/src/lib/zxc_dispatch.c' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_compress_chunk_wrapper_avx2' filepath='/src/src/lib/zxc_dispatch.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_compress_chunk_wrapper_avx512' filepath='/src/src/lib/zxc_dispatch.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_compress_chunk_wrapper_sse2' filepath='/src/src/lib/zxc_dispatch.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_cctx_attach_dict_huf' filepath='/src/src/lib/zxc_internal.h' line='1662' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_cctx_compute_workspace_size' filepath='/src/src/lib/zxc_internal.h' line='1679' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='zxc_cctx_init_in_workspace' filepath='/src/src/lib/zxc_internal.h' line='1714' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_write_file_header' filepath='/src/src/lib/zxc_internal.h' line='1828' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_read_file_header' filepath='/src/src/lib/zxc_internal.h' line='1850' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_read_block_header' filepath='/src/src/lib/zxc_internal.h' line='1884' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_write_file_footer' filepath='/src/src/lib/zxc_internal.h' line='1903' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='calloc' filepath='/src/usr/include/stdlib.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='realloc' filepath='/src/usr/include/stdlib.h' line='683' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-12'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_driver.c' comp-dir-path='/src/build' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-60' size-in-bits='320' id='type-id-61'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-62' id='type-id-63'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-60' size-in-bits='384' id='type-id-64'>
      <subrange length='48' lower-bound='0' upper-bound='47' type-id='type-id-62' id='type-id-65'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-60' size-in-bits='32' id='type-id-66'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-62' id='type-id-67'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-60' size-in-bits='448' id='type-id-68'>
      <subrange length='56' lower-bound='0' upper-bound='55' type-id='type-id-62' id='type-id-69'/>
    </array-type-def>
    <type-decl name='long long int' size-in-bits='64' id='type-id-70'/>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='94' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__wseq' type-id='type-id-72' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__g1_start' type-id='type-id-72' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='type-id-73' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='type-id-73' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='type-id-74' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='type-id-74' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='type-id-73' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='51' column='1' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-76' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-76' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='22' column='1' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-11' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-74' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-11' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-74' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-11' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-78' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-78' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-79' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='28' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='type-id-74' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='type-id-74' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__atomic_wide_counter' type-id='type-id-81' filepath='/src/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='33' column='1' id='type-id-72'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-75' filepath='/src/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='55' column='1' id='type-id-79'/>
    <typedef-decl name='__ssize_t' type-id='type-id-82' filepath='/src/usr/include/x86_64-linux-gnu/bits/types.h' line='194' column='1' id='type-id-83'/>
    <typedef-decl name='pthread_attr_t' type-id='type-id-84' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='62' column='1' id='type-id-85'/>
    <typedef-decl name='pthread_cond_t' type-id='type-id-86' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='80' column='1' id='type-id-87'/>
    <typedef-decl name='pthread_condattr_t' type-id='type-id-88' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='45' column='1' id='type-id-89'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-90' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-91'/>
    <typedef-decl name='pthread_mutexattr_t' type-id='type-id-92' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='36' column='1' id='type-id-93'/>
    <typedef-decl name='pthread_t' type-id='type-id-62' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='27' column='1' id='type-id-94'/>
    <typedef-decl name='ssize_t' type-id='type-id-83' filepath='/src/usr/include/stdio.h' line='78' column='1' id='type-id-95'/>
    <union-decl name='__atomic_wide_counter' size-in-bits='64' naming-typedef-id='type-id-72' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='25' column='1' id='type-id-81'>
      <data-member access='public'>
        <var-decl name='__value64' type-id='type-id-96' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='27' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__value32' type-id='type-id-80' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='32' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='56' column='1' id='type-id-84'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-68' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='58' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-82' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='59' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_cond_t' size-in-bits='384' naming-typedef-id='type-id-87' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='75' column='1' id='type-id-86'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-71' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-64' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-70' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_condattr_t' size-in-bits='32' naming-typedef-id='type-id-89' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='41' column='1' id='type-id-88'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-66' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='43' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-11' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='44' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='type-id-91' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-90'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-77' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-61' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-82' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_mutexattr_t' size-in-bits='32' naming-typedef-id='type-id-93' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='32' column='1' id='type-id-92'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-66' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='34' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-11' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='35' column='1'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-74' size-in-bits='64' id='type-id-73'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-62' id='type-id-97'/>
    </array-type-def>
    <type-decl name='unsigned long long int' size-in-bits='64' id='type-id-96'/>
    <qualified-type-def type-id='type-id-98' restrict='yes' id='type-id-99'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-76'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-100'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-101'/>
    <qualified-type-def type-id='type-id-101' restrict='yes' id='type-id-102'/>
    <qualified-type-def type-id='type-id-89' const='yes' id='type-id-103'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
    <qualified-type-def type-id='type-id-104' restrict='yes' id='type-id-105'/>
    <qualified-type-def type-id='type-id-93' const='yes' id='type-id-106'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-107'/>
    <qualified-type-def type-id='type-id-108' const='yes' id='type-id-109'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-35'/>
    <qualified-type-def type-id='type-id-42' const='yes' id='type-id-110'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-111'/>
    <qualified-type-def type-id='type-id-111' restrict='yes' id='type-id-53'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-112'/>
    <qualified-type-def type-id='type-id-112' restrict='yes' id='type-id-113'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-114'/>
    <qualified-type-def type-id='type-id-114' restrict='yes' id='type-id-115'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-116'/>
    <qualified-type-def type-id='type-id-116' restrict='yes' id='type-id-117'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-58'/>
    <qualified-type-def type-id='type-id-12' restrict='yes' id='type-id-120'/>
    <qualified-type-def type-id='type-id-12' restrict='yes' id='type-id-121'/>
    <function-decl name='zxc_seekable_open_reader' filepath='/src/src/lib/../../include/zxc_seekable.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-122'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='zxc_seek_table_size' filepath='/src/src/lib/../../include/zxc_seekable.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='zxc_aligned_malloc' filepath='/src/src/lib/zxc_internal.h' line='1302' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='zxc_aligned_free' filepath='/src/src/lib/zxc_internal.h' line='1314' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper' filepath='/src/src/lib/zxc_internal.h' line='1761' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zxc_seekable_attach_owned_ctx' filepath='/src/src/lib/zxc_internal.h' line='1924' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='pthread_create' filepath='/src/usr/include/pthread.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_join' filepath='/src/usr/include/pthread.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-94'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' filepath='/src/usr/include/pthread.h' line='781' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-114'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' filepath='/src/usr/include/pthread.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-114'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/src/usr/include/pthread.h' line='794' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-114'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/src/usr/include/pthread.h' line='835' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-114'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_cond_init' filepath='/src/usr/include/pthread.h' line='1112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_cond_destroy' filepath='/src/usr/include/pthread.h' line='1117' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_cond_signal' filepath='/src/usr/include/pthread.h' line='1121' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_cond_broadcast' filepath='/src/usr/include/pthread.h' line='1125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_cond_wait' filepath='/src/usr/include/pthread.h' line='1133' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fwrite' filepath='/src/usr/include/stdio.h' line='745' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-121'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fileno' filepath='/src/usr/include/stdio.h' line='883' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='sysconf' filepath='/src/usr/include/unistd.h' line='640' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='__fread_chk' filepath='/src/usr/include/x86_64-linux-gnu/bits/stdio2-decl.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='__pread64_chk' filepath='/src/usr/include/x86_64-linux-gnu/bits/unistd-decl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-124'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-95'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-118'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-12'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-125'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-52'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_huffman.c' comp-dir-path='/src/build' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_pstream.c' comp-dir-path='/src/build' language='LANG_C11'>
    <function-decl name='zxc_compress_block_bound' filepath='/src/src/lib/../../include/zxc_buffer.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zxc_compress_block' filepath='/src/src/lib/../../include/zxc_buffer.h' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-127'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zxc_create_cctx' filepath='/src/src/lib/../../include/zxc_buffer.h' line='478' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-127'/>
      <return type-id='type-id-126'/>
    </function-decl>
    <function-decl name='zxc_free_cctx' filepath='/src/src/lib/../../include/zxc_buffer.h' line='487' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_seekable.c' comp-dir-path='/src/build' language='LANG_C11'>
    <qualified-type-def type-id='type-id-12' restrict='yes' id='type-id-128'/>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-c' comp-dir-path='/src/build' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' id='type-id-60'/>
    <array-type-def dimensions='1' type-id='type-id-60' size-in-bits='8' id='type-id-129'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-62' id='type-id-130'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-60' size-in-bits='160' id='type-id-131'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-62' id='type-id-132'/>
    </array-type-def>
    <array-type-def dimensions='2' type-id='type-id-133' size-in-bits='16384' id='type-id-134'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-62' id='type-id-135'/>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-62' id='type-id-136'/>
    </array-type-def>
    <array-type-def dimensions='3' type-id='type-id-133' size-in-bits='147456' id='type-id-137'>
      <subrange length='9' lower-bound='0' upper-bound='8' type-id='type-id-62' id='type-id-138'/>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-62' id='type-id-135'/>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-62' id='type-id-136'/>
    </array-type-def>
    <enum-decl name='cstream_state_t' naming-typedef-id='type-id-139' filepath='/src/src/lib/zxc_pstream.c' line='69' column='1' id='type-id-140'>
      <underlying-type type-id='type-id-141'/>
      <enumerator name='CS_INIT' value='0'/>
      <enumerator name='CS_DRAIN_HEADER' value='1'/>
      <enumerator name='CS_ACCUMULATE' value='2'/>
      <enumerator name='CS_DRAIN_BLOCK' value='3'/>
      <enumerator name='CS_DRAIN_LAST' value='4'/>
      <enumerator name='CS_DRAIN_EOF' value='5'/>
      <enumerator name='CS_DRAIN_FOOTER' value='6'/>
      <enumerator name='CS_DONE' value='7'/>
      <enumerator name='CS_ERRORED' value='8'/>
    </enum-decl>
    <enum-decl name='dstream_state_t' naming-typedef-id='type-id-142' filepath='/src/src/lib/zxc_pstream.c' line='641' column='1' id='type-id-143'>
      <underlying-type type-id='type-id-141'/>
      <enumerator name='DS_NEED_FILE_HEADER' value='0'/>
      <enumerator name='DS_NEED_BLOCK_HEADER' value='1'/>
      <enumerator name='DS_NEED_BLOCK_PAYLOAD' value='2'/>
      <enumerator name='DS_DECODE_BLOCK' value='3'/>
      <enumerator name='DS_EMIT_DECODED' value='4'/>
      <enumerator name='DS_PEEK_TAIL' value='5'/>
      <enumerator name='DS_DRAIN_SEK_PAYLOAD' value='6'/>
      <enumerator name='DS_NEED_FOOTER_FULL' value='7'/>
      <enumerator name='DS_NEED_FOOTER_REST' value='8'/>
      <enumerator name='DS_VALIDATE_FOOTER' value='9'/>
      <enumerator name='DS_DONE' value='10'/>
      <enumerator name='DS_ERRORED' value='11'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-11'/>
    <array-type-def dimensions='1' type-id='type-id-144' size-in-bits='208' id='type-id-145'>
      <subrange length='13' lower-bound='0' upper-bound='12' type-id='type-id-62' id='type-id-146'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-144' size-in-bits='32' id='type-id-147'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-62' id='type-id-97'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-144' size-in-bits='8176' id='type-id-148'>
      <subrange length='511' lower-bound='0' upper-bound='510' type-id='type-id-62' id='type-id-149'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-82'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-78'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-150'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-11' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-152' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-152' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-152' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-152' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-152' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-152' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-152' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-152' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-152' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-152' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-152' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-153' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-154' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-11' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-11' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-155' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-156' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-150' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-129' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-157' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-124' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-158' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-159' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-154' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-12' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-15' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-11' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-131' visibility='default' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_block_header_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-108' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1805' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='block_type' type-id='type-id-19' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='block_flags' type-id='type-id-19' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1807' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='type-id-19' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='header_crc' type-id='type-id-19' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1809' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='comp_size' type-id='type-id-18' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1810' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_cctx_s' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1200' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='inner' type-id='type-id-42' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='initialized' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='owns_workspace' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='last_block_size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='stored_level' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='stored_checksum' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='stored_block_size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1210' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_cctx_t' size-in-bits='1984' is-struct='yes' naming-typedef-id='type-id-42' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1570' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hash_table' type-id='type-id-57' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hash_tags' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='chain_table' type-id='type-id-163' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='memory_block' type-id='type-id-12' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='epoch' type-id='type-id-18' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='buf_sequences' type-id='type-id-57' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='buf_tokens' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='buf_offsets' type-id='type-id-163' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='buf_extras' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='literals' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1584' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='lit_buffer' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='lit_buffer_cap' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='work_buf' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1589' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='work_buf_cap' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tok_buffer' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1591' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tok_buffer_cap' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='pivco_scratch' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='pivco_scratch_cap' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='entropy_block' type-id='type-id-12' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='opt_scratch' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1602' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='opt_scratch_cap' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='checksum_enabled' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='compression_level' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='dict_size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='dict_buffer' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='dict_buffer_cap' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='dict_huf' type-id='type-id-164' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='dict_huf_tree_ok' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='lit_freq_acc' type-id='type-id-57' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='chunk_size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='offset_bits' type-id='type-id-18' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='offset_mask' type-id='type-id-18' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='max_epoch' type-id='type-id-18' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1626' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_compress_opts_t' size-in-bits='512' is-struct='yes' naming-typedef-id='type-id-165' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='61' column='1' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='n_threads' type-id='type-id-11' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='level' type-id='type-id-11' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='block_size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='checksum_enabled' type-id='type-id-11' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='seekable' type-id='type-id-11' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dict' type-id='type-id-12' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dict_size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dict_huf' type-id='type-id-12' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='progress_cb' type-id='type-id-167' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='user_data' type-id='type-id-12' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_cstream_s' size-in-bits='1216' is-struct='yes' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='123' column='1' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts' type-id='type-id-165' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cctx' type-id='type-id-126' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='block_size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='in_block' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='in_used' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='pending' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='pending_cap' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='pending_len' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='pending_pos' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='total_in' type-id='type-id-22' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='global_hash' type-id='type-id-18' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='state' type-id='type-id-139' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='error_code' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='140' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_dctx_s' size-in-bits='2176' is-struct='yes' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1398' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='inner' type-id='type-id-42' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='last_block_size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='last_dict_size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='initialized' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='owns_workspace' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1403' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_decompress_opts_t' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-170' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='88' column='1' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='n_threads' type-id='type-id-11' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='checksum_enabled' type-id='type-id-11' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dict' type-id='type-id-12' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dict_size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dict_huf' type-id='type-id-12' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='progress_cb' type-id='type-id-167' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='user_data' type-id='type-id-12' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_dict_huf_state_t' size-in-bits='65888' is-struct='yes' naming-typedef-id='type-id-172' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='652' column='1' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tree' type-id='type-id-6' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='653' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41184'>
        <var-decl name='codes' type-id='type-id-174' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49376'>
        <var-decl name='code_len' type-id='type-id-175' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='51424'>
        <var-decl name='dec' type-id='type-id-3' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='656' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_dstream_s' size-in-bits='3776' is-struct='yes' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='719' column='1' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts' type-id='type-id-170' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='inner' type-id='type-id-42' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='inner_initialized' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='722' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='block_size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='file_has_checksum' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='scratch' type-id='type-id-177' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='scratch_used' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='scratch_need' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='payload' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='730' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='payload_cap' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='731' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='payload_used' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='732' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='payload_need' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='decoded' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='decoded_cap' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='decoded_size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='decoded_pos' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='738' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='cur_bh' type-id='type-id-108' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='740' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='sek_remaining' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='741' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='total_out' type-id='type-id-22' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='global_hash' type-id='type-id-18' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3680'>
        <var-decl name='state' type-id='type-id-142' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='746' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='error_code' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='747' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_inbuf_t' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-178' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='88' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src' type-id='type-id-12' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pos' type-id='type-id-15' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_outbuf_t' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-180' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='108' column='1' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dst' type-id='type-id-12' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pos' type-id='type-id-15' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_pivco_decode_aux_t' size-in-bits='14448' is-struct='yes' naming-typedef-id='type-id-3' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='637' column='1' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='skip' type-id='type-id-183' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='c2s_off' type-id='type-id-184' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='639' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12272'>
        <var-decl name='c2s_pool' type-id='type-id-185' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='640' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_pivco_node_t' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-186' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='594' column='1' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='child' type-id='type-id-147' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sym' type-id='type-id-144' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='596' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_pivco_tree_t' size-in-bits='41184' is-struct='yes' naming-typedef-id='type-id-6' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='607' column='1' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nd' type-id='type-id-189' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24528'>
        <var-decl name='bfs' type-id='type-id-148' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32704'>
        <var-decl name='lvl_start' type-id='type-id-145' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32928'>
        <var-decl name='n_nodes' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='max_depth' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32992'>
        <var-decl name='flat_d' type-id='type-id-183' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37080'>
        <var-decl name='covered' type-id='type-id-183' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='621' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_reader_t' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-190' visibility='default' filepath='/src/src/lib/../../include/zxc_seekable.h' line='108' column='1' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read_at' type-id='type-id-192' visibility='default' filepath='/src/src/lib/../../include/zxc_seekable.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctx' type-id='type-id-12' visibility='default' filepath='/src/src/lib/../../include/zxc_seekable.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-22' visibility='default' filepath='/src/src/lib/../../include/zxc_seekable.h' line='126' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_seekable_s' size-in-bits='4032' is-struct='yes' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='220' column='1' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src' type-id='type-id-1' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='src_size' type-id='type-id-22' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reader' type-id='type-id-190' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='owned_reader_ctx' type-id='type-id-12' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='num_blocks' type-id='type-id-18' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='comp_sizes' type-id='type-id-57' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='comp_offsets' type-id='type-id-194' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='total_decomp' type-id='type-id-22' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='block_size' type-id='type-id-18' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='file_has_checksums' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='expected_dict_id' type-id='type-id-18' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='dctx' type-id='type-id-42' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='dctx_initialized' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='dict' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='dict_size' type-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='dict_huf' type-id='type-id-195' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='has_dict_huf' type-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='256' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-151' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-196'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-13' filepath='/src/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-197'/>
    <typedef-decl name='__int16_t' type-id='type-id-78' filepath='/src/usr/include/x86_64-linux-gnu/bits/types.h' line='39' column='1' id='type-id-198'/>
    <typedef-decl name='__int64_t' type-id='type-id-82' filepath='/src/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-199'/>
    <typedef-decl name='__off64_t' type-id='type-id-82' filepath='/src/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-124'/>
    <typedef-decl name='__off_t' type-id='type-id-82' filepath='/src/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-155'/>
    <typedef-decl name='__uint16_t' type-id='type-id-156' filepath='/src/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-200'/>
    <typedef-decl name='__uint32_t' type-id='type-id-74' filepath='/src/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-201'/>
    <typedef-decl name='__uint64_t' type-id='type-id-62' filepath='/src/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-202'/>
    <typedef-decl name='__uint8_t' type-id='type-id-203' filepath='/src/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-204'/>
    <typedef-decl name='cstream_state_t' type-id='type-id-140' filepath='/src/src/lib/zxc_pstream.c' line='79' column='1' id='type-id-139'/>
    <typedef-decl name='dstream_state_t' type-id='type-id-143' filepath='/src/src/lib/zxc_pstream.c' line='654' column='1' id='type-id-142'/>
    <typedef-decl name='int16_t' type-id='type-id-198' filepath='/src/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='25' column='1' id='type-id-144'/>
    <typedef-decl name='int64_t' type-id='type-id-199' filepath='/src/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-52'/>
    <typedef-decl name='size_t' type-id='type-id-62' filepath='/src/usr/lib/gcc/x86_64-linux-gnu/13/include/stddef.h' line='214' column='1' id='type-id-15'/>
    <typedef-decl name='uint16_t' type-id='type-id-200' filepath='/src/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='25' column='1' id='type-id-205'/>
    <typedef-decl name='uint32_t' type-id='type-id-201' filepath='/src/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-18'/>
    <typedef-decl name='uint64_t' type-id='type-id-202' filepath='/src/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-22'/>
    <typedef-decl name='uint8_t' type-id='type-id-204' filepath='/src/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-19'/>
    <typedef-decl name='zxc_block_header_t' type-id='type-id-160' filepath='/src/src/lib/zxc_internal.h' line='1811' column='1' id='type-id-108'/>
    <typedef-decl name='zxc_cctx' type-id='type-id-161' filepath='/src/src/lib/../../include/zxc_buffer.h' line='271' column='1' id='type-id-206'/>
    <typedef-decl name='zxc_cctx_t' type-id='type-id-162' filepath='/src/src/lib/zxc_internal.h' line='1627' column='1' id='type-id-42'/>
    <typedef-decl name='zxc_compress_opts_t' type-id='type-id-166' filepath='/src/src/lib/../../include/zxc_opts.h' line='76' column='1' id='type-id-165'/>
    <typedef-decl name='zxc_cstream' type-id='type-id-168' filepath='/src/src/lib/../../include/zxc_pstream.h' line='116' column='1' id='type-id-207'/>
