<abi-corpus version='2.2' path='build/libzxc.so.0.11.0' architecture='elf-amd-x86_64' soname='libzxc.so.4'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='zxc_compress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_compress_block' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_compress_block_bound' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_compress_bound' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_compress_cctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_compress_opts_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_create_cctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_create_dctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_cstream_compress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zxc_estimate_cctx_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_free_cctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_free_dctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_get_decompressed_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_get_dict_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_init_static_cctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_init_static_dctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_max_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_min_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seek_table_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_decompress_range' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_decompress_range_mt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_get_block_comp_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_get_block_decomp_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_get_decompressed_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_get_num_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_open' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_open_file' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_open_reader' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_seekable_set_dict' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_static_cctx_workspace_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_static_dctx_workspace_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_stream_compress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_stream_decompress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_stream_get_decompressed_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_train_dict' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_train_dict_huf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_version_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zxc_write_seek_table' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='/src/src/lib/zxc_common.c' comp-dir-path='/src/build' language='LANG_C11'>
    <qualified-type-def type-id='type-id-1' restrict='yes' id='type-id-2'/>
    <qualified-type-def type-id='type-id-3' restrict='yes' id='type-id-4'/>
    <function-decl name='zxc_huf_build_dec_table' filepath='/src/src/lib/zxc_internal.h' line='1473' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_unpack_lengths' filepath='/src/src/lib/zxc_internal.h' line='1484' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_memalign' filepath='/usr/lib/gcc/x86_64-linux-gnu/13/include/mm_malloc.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_compress.c' comp-dir-path='/src/build' language='LANG_C11'>
    <class-decl name='zxc_gnr_header_t' size-in-bits='96' is-struct='yes' naming-typedef-id='type-id-11' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='853' column='1' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='n_sequences' type-id='type-id-13' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='854' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='n_literals' type-id='type-id-13' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='enc_lit' type-id='type-id-14' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='856' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='enc_litlen' type-id='type-id-14' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='857' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='enc_mlen' type-id='type-id-14' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='enc_off' type-id='type-id-14' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='859' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_section_desc_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-15' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='869' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sizes' type-id='type-id-17' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='870' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zxc_gnr_header_t' type-id='type-id-12' filepath='/src/src/lib/zxc_internal.h' line='860' column='1' id='type-id-11'/>
    <typedef-decl name='zxc_section_desc_t' type-id='type-id-16' filepath='/src/src/lib/zxc_internal.h' line='871' column='1' id='type-id-15'/>
    <qualified-type-def type-id='type-id-11' const='yes' id='type-id-18'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-19'/>
    <qualified-type-def type-id='type-id-19' restrict='yes' id='type-id-20'/>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-21'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-22'/>
    <qualified-type-def type-id='type-id-7' restrict='yes' id='type-id-23'/>
    <qualified-type-def type-id='type-id-7' restrict='yes' id='type-id-24'/>
    <qualified-type-def type-id='type-id-7' restrict='yes' id='type-id-25'/>
    <qualified-type-def type-id='type-id-7' restrict='yes' id='type-id-26'/>
    <function-decl name='zxc_write_glo_header_and_desc' filepath='/src/src/lib/zxc_internal.h' line='1329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_write_ghi_header_and_desc' filepath='/src/src/lib/zxc_internal.h' line='1360' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_build_code_lengths_avx2' filepath='/src/src/lib/zxc_internal.h' line='1406' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_build_code_lengths_avx512' filepath='/src/src/lib/zxc_internal.h' line='1406' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_build_code_lengths_default' filepath='/src/src/lib/zxc_internal.h' line='1406' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_build_code_lengths_sse2' filepath='/src/src/lib/zxc_internal.h' line='1406' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_avx2' filepath='/src/src/lib/zxc_internal.h' line='1423' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_avx512' filepath='/src/src/lib/zxc_internal.h' line='1423' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_default' filepath='/src/src/lib/zxc_internal.h' line='1423' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_sse2' filepath='/src/src/lib/zxc_internal.h' line='1423' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_dict_avx2' filepath='/src/src/lib/zxc_internal.h' line='1449' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_dict_avx512' filepath='/src/src/lib/zxc_internal.h' line='1449' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_dict_default' filepath='/src/src/lib/zxc_internal.h' line='1449' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_encode_section_dict_sse2' filepath='/src/src/lib/zxc_internal.h' line='1449' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_unpack_lengths_avx2' filepath='/src/src/lib/zxc_internal.h' line='1484' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_unpack_lengths_avx512' filepath='/src/src/lib/zxc_internal.h' line='1484' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_unpack_lengths_default' filepath='/src/src/lib/zxc_internal.h' line='1484' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_unpack_lengths_sse2' filepath='/src/src/lib/zxc_internal.h' line='1484' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_write_block_header' filepath='/src/src/lib/zxc_internal.h' line='1781' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_decompress.c' comp-dir-path='/src/build' language='LANG_C11'>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-30'/>
    <qualified-type-def type-id='type-id-30' restrict='yes' id='type-id-31'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-32'/>
    <function-decl name='zxc_read_glo_header_and_desc' filepath='/src/src/lib/zxc_internal.h' line='1346' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_read_ghi_header_and_desc' filepath='/src/src/lib/zxc_internal.h' line='1378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_avx2' filepath='/src/src/lib/zxc_internal.h' line='1438' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_avx512' filepath='/src/src/lib/zxc_internal.h' line='1438' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_default' filepath='/src/src/lib/zxc_internal.h' line='1438' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_sse2' filepath='/src/src/lib/zxc_internal.h' line='1438' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_dict_avx2' filepath='/src/src/lib/zxc_internal.h' line='1464' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_dict_avx512' filepath='/src/src/lib/zxc_internal.h' line='1464' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_dict_default' filepath='/src/src/lib/zxc_internal.h' line='1464' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_decode_section_dict_sse2' filepath='/src/src/lib/zxc_internal.h' line='1464' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_dict.c' comp-dir-path='/src/build' language='LANG_C11'>
    <qualified-type-def type-id='type-id-34' restrict='yes' id='type-id-28'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-36'/>
    <qualified-type-def type-id='type-id-36' restrict='yes' id='type-id-37'/>
    <function-decl name='zxc_compress_bound' filepath='/src/src/lib/../../include/zxc_buffer.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zxc_huf_build_code_lengths' filepath='/src/src/lib/zxc_internal.h' line='1406' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_pack_lengths' filepath='/src/src/lib/zxc_internal.h' line='1478' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zxc_cctx_init' filepath='/src/src/lib/zxc_internal.h' line='1581' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_cctx_free' filepath='/src/src/lib/zxc_internal.h' line='1653' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zxc_compress_chunk_wrapper' filepath='/src/src/lib/zxc_internal.h' line='1700' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='672' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_dispatch.c' comp-dir-path='/src/build' language='LANG_C11'>
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-41'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-42'/>
    <qualified-type-def type-id='type-id-42' restrict='yes' id='type-id-33'/>
    <function-decl name='zxc_dict_id' filepath='/src/src/lib/../../include/zxc_dict.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zxc_write_seek_table' filepath='/src/src/lib/../../include/zxc_seekable.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_default' filepath='/src/src/lib/zxc_dispatch.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_dict_default' filepath='/src/src/lib/zxc_dispatch.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_safe_default' filepath='/src/src/lib/zxc_dispatch.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_avx2' filepath='/src/src/lib/zxc_dispatch.c' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_dict_avx2' filepath='/src/src/lib/zxc_dispatch.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_avx512' filepath='/src/src/lib/zxc_dispatch.c' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_dict_avx512' filepath='/src/src/lib/zxc_dispatch.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_safe_avx2' filepath='/src/src/lib/zxc_dispatch.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_safe_avx512' filepath='/src/src/lib/zxc_dispatch.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_sse2' filepath='/src/src/lib/zxc_dispatch.c' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_dict_sse2' filepath='/src/src/lib/zxc_dispatch.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper_safe_sse2' filepath='/src/src/lib/zxc_dispatch.c' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_compress_chunk_wrapper_default' filepath='/src/src/lib/zxc_dispatch.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_build_dec_table_default' filepath='/src/src/lib/zxc_dispatch.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_huf_pack_lengths_default' filepath='/src/src/lib/zxc_dispatch.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zxc_compress_chunk_wrapper_avx2' filepath='/src/src/lib/zxc_dispatch.c' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_compress_chunk_wrapper_avx512' filepath='/src/src/lib/zxc_dispatch.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_compress_chunk_wrapper_sse2' filepath='/src/src/lib/zxc_dispatch.c' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_cctx_attach_dict_huf' filepath='/src/src/lib/zxc_internal.h' line='1595' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_cctx_compute_workspace_size' filepath='/src/src/lib/zxc_internal.h' line='1612' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='zxc_cctx_init_in_workspace' filepath='/src/src/lib/zxc_internal.h' line='1641' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_write_file_header' filepath='/src/src/lib/zxc_internal.h' line='1742' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_read_file_header' filepath='/src/src/lib/zxc_internal.h' line='1764' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_read_block_header' filepath='/src/src/lib/zxc_internal.h' line='1798' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_write_file_footer' filepath='/src/src/lib/zxc_internal.h' line='1817' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='realloc' filepath='/usr/include/stdlib.h' line='683' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_driver.c' comp-dir-path='/src/build' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='320' id='type-id-54'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-55' id='type-id-56'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='384' id='type-id-57'>
      <subrange length='48' lower-bound='0' upper-bound='47' type-id='type-id-55' id='type-id-58'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='32' id='type-id-59'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-55' id='type-id-60'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='448' id='type-id-61'>
      <subrange length='56' lower-bound='0' upper-bound='55' type-id='type-id-55' id='type-id-62'/>
    </array-type-def>
    <type-decl name='long long int' size-in-bits='64' id='type-id-63'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-64'/>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='94' column='1' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__wseq' type-id='type-id-66' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__g1_start' type-id='type-id-66' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='type-id-67' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='type-id-67' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='type-id-68' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='type-id-68' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='type-id-67' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='51' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-70' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-70' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='22' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-68' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-68' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-64' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-64' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='28' column='1' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='type-id-68' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='type-id-68' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__atomic_wide_counter' type-id='type-id-74' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='33' column='1' id='type-id-66'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-69' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='55' column='1' id='type-id-72'/>
    <typedef-decl name='__ssize_t' type-id='type-id-75' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='194' column='1' id='type-id-76'/>
    <typedef-decl name='pthread_attr_t' type-id='type-id-77' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='62' column='1' id='type-id-78'/>
    <typedef-decl name='pthread_cond_t' type-id='type-id-79' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='80' column='1' id='type-id-80'/>
    <typedef-decl name='pthread_condattr_t' type-id='type-id-81' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='45' column='1' id='type-id-82'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-83' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-84'/>
    <typedef-decl name='pthread_mutexattr_t' type-id='type-id-85' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='36' column='1' id='type-id-86'/>
    <typedef-decl name='pthread_t' type-id='type-id-55' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='27' column='1' id='type-id-87'/>
    <typedef-decl name='ssize_t' type-id='type-id-76' filepath='/usr/include/stdio.h' line='78' column='1' id='type-id-88'/>
    <union-decl name='__atomic_wide_counter' size-in-bits='64' naming-typedef-id='type-id-66' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='25' column='1' id='type-id-74'>
      <data-member access='public'>
        <var-decl name='__value64' type-id='type-id-89' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='27' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__value32' type-id='type-id-73' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='32' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='56' column='1' id='type-id-77'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-61' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='58' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-75' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='59' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_cond_t' size-in-bits='384' naming-typedef-id='type-id-80' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='75' column='1' id='type-id-79'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-57' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-63' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_condattr_t' size-in-bits='32' naming-typedef-id='type-id-82' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='41' column='1' id='type-id-81'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-59' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='43' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='44' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='type-id-84' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-83'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-71' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-75' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_mutexattr_t' size-in-bits='32' naming-typedef-id='type-id-86' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='32' column='1' id='type-id-85'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-59' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='34' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='35' column='1'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-68' size-in-bits='64' id='type-id-67'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-55' id='type-id-90'/>
    </array-type-def>
    <type-decl name='unsigned long long int' size-in-bits='64' id='type-id-89'/>
    <qualified-type-def type-id='type-id-91' restrict='yes' id='type-id-92'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-70'/>
    <qualified-type-def type-id='type-id-78' const='yes' id='type-id-93'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-94'/>
    <qualified-type-def type-id='type-id-94' restrict='yes' id='type-id-95'/>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-96'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-97'/>
    <qualified-type-def type-id='type-id-97' restrict='yes' id='type-id-98'/>
    <qualified-type-def type-id='type-id-86' const='yes' id='type-id-99'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-100'/>
    <qualified-type-def type-id='type-id-101' const='yes' id='type-id-102'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-29'/>
    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-103'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
    <qualified-type-def type-id='type-id-104' restrict='yes' id='type-id-46'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-105'/>
    <qualified-type-def type-id='type-id-105' restrict='yes' id='type-id-106'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-107'/>
    <qualified-type-def type-id='type-id-107' restrict='yes' id='type-id-108'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-109'/>
    <qualified-type-def type-id='type-id-109' restrict='yes' id='type-id-110'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-51'/>
    <qualified-type-def type-id='type-id-7' restrict='yes' id='type-id-113'/>
    <qualified-type-def type-id='type-id-7' restrict='yes' id='type-id-114'/>
    <function-decl name='zxc_seekable_open_reader' filepath='/src/src/lib/../../include/zxc_seekable.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='zxc_seek_table_size' filepath='/src/src/lib/../../include/zxc_seekable.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='zxc_aligned_malloc' filepath='/src/src/lib/zxc_internal.h' line='1188' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='zxc_aligned_free' filepath='/src/src/lib/zxc_internal.h' line='1200' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zxc_decompress_chunk_wrapper' filepath='/src/src/lib/zxc_internal.h' line='1675' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zxc_seekable_attach_owned_ctx' filepath='/src/src/lib/zxc_internal.h' line='1838' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_create' filepath='/usr/include/pthread.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_join' filepath='/usr/include/pthread.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' filepath='/usr/include/pthread.h' line='781' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' filepath='/usr/include/pthread.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='794' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='835' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_cond_init' filepath='/usr/include/pthread.h' line='1112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_cond_destroy' filepath='/usr/include/pthread.h' line='1117' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_cond_signal' filepath='/usr/include/pthread.h' line='1121' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_cond_broadcast' filepath='/usr/include/pthread.h' line='1125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_cond_wait' filepath='/usr/include/pthread.h' line='1133' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-108'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fwrite' filepath='/usr/include/stdio.h' line='745' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-114'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='fileno' filepath='/usr/include/stdio.h' line='883' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='sysconf' filepath='/usr/include/unistd.h' line='640' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='__fread_chk' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2-decl.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__pread64_chk' filepath='/usr/include/x86_64-linux-gnu/bits/unistd-decl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-88'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-111'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-118'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-45'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_huffman.c' comp-dir-path='/src/build' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_pstream.c' comp-dir-path='/src/build' language='LANG_C11'>
    <function-decl name='zxc_compress_block_bound' filepath='/src/src/lib/../../include/zxc_buffer.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zxc_compress_block' filepath='/src/src/lib/../../include/zxc_buffer.h' line='285' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='zxc_create_cctx' filepath='/src/src/lib/../../include/zxc_buffer.h' line='410' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='zxc_free_cctx' filepath='/src/src/lib/../../include/zxc_buffer.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/lib/zxc_seekable.c' comp-dir-path='/src/build' language='LANG_C11'>
    <qualified-type-def type-id='type-id-7' restrict='yes' id='type-id-121'/>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-c' comp-dir-path='/src/build' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' id='type-id-53'/>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='8' id='type-id-122'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-55' id='type-id-123'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='160' id='type-id-124'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-55' id='type-id-125'/>
    </array-type-def>
    <enum-decl name='cstream_state_t' naming-typedef-id='type-id-126' filepath='/src/src/lib/zxc_pstream.c' line='69' column='1' id='type-id-127'>
      <underlying-type type-id='type-id-128'/>
      <enumerator name='CS_INIT' value='0'/>
      <enumerator name='CS_DRAIN_HEADER' value='1'/>
      <enumerator name='CS_ACCUMULATE' value='2'/>
      <enumerator name='CS_DRAIN_BLOCK' value='3'/>
      <enumerator name='CS_DRAIN_LAST' value='4'/>
      <enumerator name='CS_DRAIN_EOF' value='5'/>
      <enumerator name='CS_DRAIN_FOOTER' value='6'/>
      <enumerator name='CS_DONE' value='7'/>
      <enumerator name='CS_ERRORED' value='8'/>
    </enum-decl>
    <enum-decl name='dstream_state_t' naming-typedef-id='type-id-129' filepath='/src/src/lib/zxc_pstream.c' line='608' column='1' id='type-id-130'>
      <underlying-type type-id='type-id-128'/>
      <enumerator name='DS_NEED_FILE_HEADER' value='0'/>
      <enumerator name='DS_NEED_BLOCK_HEADER' value='1'/>
      <enumerator name='DS_NEED_BLOCK_PAYLOAD' value='2'/>
      <enumerator name='DS_DECODE_BLOCK' value='3'/>
      <enumerator name='DS_EMIT_DECODED' value='4'/>
      <enumerator name='DS_PEEK_TAIL' value='5'/>
      <enumerator name='DS_DRAIN_SEK_PAYLOAD' value='6'/>
      <enumerator name='DS_NEED_FOOTER_FULL' value='7'/>
      <enumerator name='DS_NEED_FOOTER_REST' value='8'/>
      <enumerator name='DS_VALIDATE_FOOTER' value='9'/>
      <enumerator name='DS_DONE' value='10'/>
      <enumerator name='DS_ERRORED' value='11'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-5'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-75'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-131'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-133' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-133' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-133' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-133' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-133' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-133' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-133' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-133' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-133' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-133' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-133' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-134' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-135' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-136' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-137' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-131' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-122' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-138' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-117' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-139' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-140' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-135' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-10' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-124' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_block_header_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-101' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1719' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='block_type' type-id='type-id-14' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='block_flags' type-id='type-id-14' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='type-id-14' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1722' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='header_crc' type-id='type-id-14' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='comp_size' type-id='type-id-13' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1724' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_cctx_s' size-in-bits='1920' is-struct='yes' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='941' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='inner' type-id='type-id-35' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='initialized' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='owns_workspace' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='last_block_size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='stored_level' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='949' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='stored_checksum' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='950' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='stored_block_size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='951' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_cctx_t' size-in-bits='1664' is-struct='yes' naming-typedef-id='type-id-35' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1514' column='1' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hash_table' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hash_tags' type-id='type-id-43' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='chain_table' type-id='type-id-144' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='memory_block' type-id='type-id-7' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='epoch' type-id='type-id-13' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1521' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='buf_sequences' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='buf_tokens' type-id='type-id-43' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='buf_offsets' type-id='type-id-144' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1526' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='buf_extras' type-id='type-id-43' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1527' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='literals' type-id='type-id-43' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1528' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='lit_buffer' type-id='type-id-43' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='lit_buffer_cap' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='work_buf' type-id='type-id-43' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='work_buf_cap' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='opt_scratch' type-id='type-id-43' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1535' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='opt_scratch_cap' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='checksum_enabled' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='compression_level' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='dict_size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1542' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='dict_buffer' type-id='type-id-43' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='dict_buffer_cap' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1545' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='dict_huf_lengths' type-id='type-id-1' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='dict_huf_table' type-id='type-id-3' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='lit_freq_acc' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='chunk_size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='offset_bits' type-id='type-id-13' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='offset_mask' type-id='type-id-13' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='max_epoch' type-id='type-id-13' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='1560' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_compress_opts_t' size-in-bits='512' is-struct='yes' naming-typedef-id='type-id-145' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='61' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='n_threads' type-id='type-id-5' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='level' type-id='type-id-5' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='block_size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='checksum_enabled' type-id='type-id-5' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='seekable' type-id='type-id-5' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dict' type-id='type-id-7' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dict_size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dict_huf' type-id='type-id-7' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='progress_cb' type-id='type-id-147' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='user_data' type-id='type-id-7' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_cstream_s' size-in-bits='1216' is-struct='yes' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='123' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts' type-id='type-id-145' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cctx' type-id='type-id-119' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='block_size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='in_block' type-id='type-id-43' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='in_used' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='pending' type-id='type-id-43' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='pending_cap' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='pending_len' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='pending_pos' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='total_in' type-id='type-id-17' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='global_hash' type-id='type-id-13' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='state' type-id='type-id-126' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='error_code' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='140' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_dctx_s' size-in-bits='1856' is-struct='yes' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1086' column='1' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='inner' type-id='type-id-35' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1087' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='last_block_size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1088' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='last_dict_size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1089' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='initialized' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1090' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='owns_workspace' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_dispatch.c' line='1091' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_decompress_opts_t' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-150' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='88' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='n_threads' type-id='type-id-5' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='checksum_enabled' type-id='type-id-5' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dict' type-id='type-id-7' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dict_size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dict_huf' type-id='type-id-7' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='progress_cb' type-id='type-id-147' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='user_data' type-id='type-id-7' visibility='default' filepath='/src/src/lib/../../include/zxc_opts.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_dstream_s' size-in-bits='3456' is-struct='yes' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='686' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts' type-id='type-id-150' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='inner' type-id='type-id-35' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='688' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='inner_initialized' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='block_size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='file_has_checksum' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='scratch' type-id='type-id-153' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='scratch_used' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='scratch_need' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='695' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='payload' type-id='type-id-43' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='697' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='payload_cap' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='payload_used' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='payload_need' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='decoded' type-id='type-id-43' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='702' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='decoded_cap' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='decoded_size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='decoded_pos' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='cur_bh' type-id='type-id-101' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='707' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='sek_remaining' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='total_out' type-id='type-id-17' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='global_hash' type-id='type-id-13' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='711' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3360'>
        <var-decl name='state' type-id='type-id-129' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='error_code' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_pstream.c' line='714' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_huf_dec_entry_t' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-40' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='629' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-13' visibility='default' filepath='/src/src/lib/zxc_internal.h' line='630' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_inbuf_t' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-155' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='88' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src' type-id='type-id-7' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pos' type-id='type-id-10' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_outbuf_t' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-157' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='102' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dst' type-id='type-id-7' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pos' type-id='type-id-10' visibility='default' filepath='/src/src/lib/../../include/zxc_pstream.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_reader_t' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-159' visibility='default' filepath='/src/src/lib/../../include/zxc_seekable.h' line='108' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read_at' type-id='type-id-161' visibility='default' filepath='/src/src/lib/../../include/zxc_seekable.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctx' type-id='type-id-7' visibility='default' filepath='/src/src/lib/../../include/zxc_seekable.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-17' visibility='default' filepath='/src/src/lib/../../include/zxc_seekable.h' line='126' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zxc_seekable_s' size-in-bits='3712' is-struct='yes' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='145' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src' type-id='type-id-1' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='src_size' type-id='type-id-17' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reader' type-id='type-id-159' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='owned_reader_ctx' type-id='type-id-7' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='num_blocks' type-id='type-id-13' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='comp_sizes' type-id='type-id-50' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='comp_offsets' type-id='type-id-163' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='total_decomp' type-id='type-id-17' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='block_size' type-id='type-id-13' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='file_has_checksums' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='expected_dict_id' type-id='type-id-13' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='dctx' type-id='type-id-35' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='dctx_initialized' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='dict' type-id='type-id-43' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='dict_size' type-id='type-id-10' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='dict_huf' type-id='type-id-164' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='has_dict_huf' type-id='type-id-5' visibility='default' filepath='/src/src/lib/zxc_seekable.c' line='181' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-132' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-165'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-8' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-166'/>
    <typedef-decl name='__int64_t' type-id='type-id-75' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-167'/>
    <typedef-decl name='__off64_t' type-id='type-id-75' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-117'/>
    <typedef-decl name='__off_t' type-id='type-id-75' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-136'/>
    <typedef-decl name='__uint16_t' type-id='type-id-137' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-168'/>
    <typedef-decl name='__uint32_t' type-id='type-id-68' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-169'/>
    <typedef-decl name='__uint64_t' type-id='type-id-55' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-170'/>
    <typedef-decl name='__uint8_t' type-id='type-id-171' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-172'/>
    <typedef-decl name='cstream_state_t' type-id='type-id-127' filepath='/src/src/lib/zxc_pstream.c' line='79' column='1' id='type-id-126'/>
    <typedef-decl name='dstream_state_t' type-id='type-id-130' filepath='/src/src/lib/zxc_pstream.c' line='621' column='1' id='type-id-129'/>
    <typedef-decl name='int64_t' type-id='type-id-167' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-45'/>
    <typedef-decl name='size_t' type-id='type-id-55' filepath='/usr/lib/gcc/x86_64-linux-gnu/13/include/stddef.h' line='214' column='1' id='type-id-10'/>
    <typedef-decl name='uint16_t' type-id='type-id-168' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='25' column='1' id='type-id-173'/>
    <typedef-decl name='uint32_t' type-id='type-id-169' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-13'/>
    <typedef-decl name='uint64_t' type-id='type-id-170' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-17'/>
    <typedef-decl name='uint8_t' type-id='type-id-172' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-14'/>
    <typedef-decl name='zxc_block_header_t' type-id='type-id-141' filepath='/src/src/lib/zxc_internal.h' line='1725' column='1' id='type-id-101'/>
    <typedef-decl name='zxc_cctx' type-id='type-id-142' filepath='/src/src/lib/../../include/zxc_buffer.h' line='218' column='1' id='type-id-174'/>
    <typedef-decl name='zxc_cctx_t' type-id='type-id-143' filepath='/src/src/lib/zxc_internal.h' line='1561' column='1' id='type-id-35'/>
    <typedef-decl name='zxc_compress_opts_t' type-id='type-id-146' filepath='/src/src/lib/../../include/zxc_opts.h' line='76' column='1' id='type-id-145'/>
    <typedef-decl name='zxc_cstream' type-id='type-id-148' filepath='/src/src/lib/../../include/zxc_pstream.h' line='110' column='1' id='type-id-175'/>
    <typedef-decl name='zxc_dctx' type-id='type-id-149' filepath='/src/src/lib/../../include/zxc_buffer.h' line='220' column='1' id='type-id-176'/>
    <typedef-decl name='zxc_decompress_opts_t' type-id='type-id-151' filepath='/src/src/lib/../../include/zxc_opts.h' line='98' column='1' id='type-id-150'/>
    <typedef-decl name='zxc_dstream' type-id='type-id-152' filepath='/src/src/lib/../../include/zxc_pstream.h' line='112' column='1' id='type-id-177'/>
